<script setup lang="ts">
const data = [
  {
    content: [
      '歡迎您來到 wowcho.com（以下稱「本網站」），本網站由渦潮負責經營，所有關於本網站之服務均依據本條款所提供。',
      '任何使用者於使用本網站服務時，請先詳讀本條款與渦潮隱私權政策，或其他本網站未來陸續公布之相關條款，並請您確實遵守上列條款與中華民國法律，若您無法確實遵守本條款內容或對於本條款內容全部或部分不同意時，請您勿使用本網站服務。如您對本條款有任何不明白處，您可以聯絡渦潮的客服部門尋求解答。',
      '若您未滿二十歲，您必須在申請加入會員之前，請您的父母或監護人閱讀本條款，並得到您的父母或監護人同意後，才可以申請、註冊及使用本網站所提供的會員服務；當您滿二十歲之前使用本網站服務，您必須向本公司擔保您已取得父母或監護人的同意。當您完成相關申請，並繼續使用本網站所提供的服務時，則表示您的父母或監護人已經閱讀、瞭解、並同意本條款。'
    ]
  },
  {
    title: '一、接受條款',
    content: [
      '渦潮所提供的服務包含渦潮網站，以及渦潮網站有關的任何其他功能、內容或應用程式（合稱 " 渦潮服務 " ）。無論您是以 " 訪客 " （表示您只是瀏覽渦潮網站），還是 " 會員 " （表示您已在渦潮註冊）的身份，使用渦潮服務即表示您同意遵守使用條款（下稱 " 本條款 " ）。 " 用戶 " 一詞泛指訪客以及會員。',
      '如果您想成為渦潮會員，並與其他會員交流（包括通過渦潮服務連接到的會員和渦潮社群的會員），以及使用渦潮服務，請您務必詳細閱讀本條款，並在註冊過程中選擇同意接受本條款。本條款的內容包括接受渦潮服務和在渦潮網站上發佈內容的規定、您使用渦潮服務所享有的權利、承擔的義務和對使用渦潮服務所受的限制、以及渦潮的隱私條款。如果您選擇使用某些渦潮服務，您可能會收到要求您下載程式或內容的通知，和/或要求您同意附加條款和條件的通知。'
    ]
  },
  {
    title: '二、條款修改',
    content: [
      '渦潮有權隨時修改本條款文本中的任何條款。一旦渦潮對本條款進行修改,渦潮將會以公告形式發布通知。任何修改將於發布之時起生效。如果您在修改發布後，繼續使用渦潮所提供的所有服務，則表示您同意遵守對本條款所作出的該等修改。因此，請您務必定期查閱本條款，以確保了解所有關於本條款的最新修改。如果您不同意渦潮對本條款進行的修改，請您離開渦潮網站並立即停止使用渦潮服務。同時，您應刪除您的個人檔案並註銷您的會員資格。'
    ]
  },
  {
    title: '三、遵守法律',
    content: [
      '當使用渦潮服務時，您必須遵守中華民國法律。您只有在同意遵守所有適用的相關法律法規和本條款時，才有權使用渦潮服務（無論您是否為訪客或決定使用此服務）。請您仔細閱讀本條款並將其妥善保存。'
    ]
  },
  {
    title: '四、用戶帳號、密碼及安全',
    content: [
      '無論訪客或會員，都可以瀏覽渦潮的內容，但使用渦潮的服務之前，用戶必須要登記並成為會員。本網站提供使用者Facebook登入與渦潮網站內註冊兩種方式成為會員。成為會員的過程中，用戶應提供及時、詳盡、準確的個人資料，包含設定一組用戶賬號以及密碼。並不斷更新註冊資料，符合及時、詳盡、準確的要求。所有原始鍵入的資料將引用為註冊資料。如發生註冊不完整或不真實的情況，此情況視為違反使用條款，渦潮有權利終止您的服務。渦潮不對任何因註冊信息不真實而引起的問題、以及問題發生所帶來的後果承擔責任。',
      '用戶在申請帳號時，不應該使用模仿他人姓名或者任何會侵害踏人權益的帳號。另外使用攻擊性的字眼或任何種族歧視的文字當作帳號名稱，渦潮有權利終止此帳號的服務。',
      '用戶不應將其帳號、密碼轉讓或出借給他人使用。如用戶發現其帳號遭他人非法使用，應立即通知渦潮。因駭客行為或用戶的保管疏忽導致帳號、密碼遭他人非法使用，渦潮網站不承擔任何責任。'
    ]
  },
  {
    title: '五、隱私權政策',
    content: [
      '您提供的註冊信息及渦潮保留的有關您的若干其它資料將受到中華民國有關隱私的法律和本公司《隱私權政策》之規範。'
    ]
  },
  {
    title: '六、使用規定和條約',
    content: [
      '遵守使用規定的前提下，用戶在使用渦潮所有服務時，必須要遵守使用條款的所有規定。任何經由渦潮服務上傳、張貼、發送電子郵件或任何其它方式傳送的文字、文件、影片、照片（包括您自己的照片）、圖片、聲音、音樂作品、創作作品或任何其他內容（以下簡稱 " 內容 " ），無論為公開傳送還是私下傳送，均由內容提供者承擔責任。渦潮無法經由本服務傳送的內容，因而不保證內容的正確性、完整性或品質。在使用本服務時，可能會接觸到令人不快、不適當或令人厭惡之內容。在任何情況下，渦潮均不為任何內容負責，包含但不限於任何內容的任何錯誤或遺漏，以及經由本服務以張貼、發送電子郵件或其它方式傳送任何內容而衍生的任何損失或損害。但渦潮有權依法停止傳輸任何前述內容並採取相應行動，包括但不限於暫停用戶使用本服務的全部或部分，保存有關記錄，甚至採取法律行動。',
      '用戶在使用渦潮服務時，必須遵守中華民國相關法律法規的規定，用戶應同意將不會利用本服務進行任何違法或不正當的活動，並上傳、展示、分享、傳播或以其它方式傳送含有下列內容之一的任何訊息（包括但不限於下列行為）∶',
      '違反任何個人或組織的專利，商標，商業機密，著作權，發布權以及其他的權利，並違反中華民國法律或是現有合約規範。 任何錯誤，誤導，虛假和不正確的資訊。 任何違反他人（包含第三方）隱私的行為。 未經同意的廣告，宣傳，垃圾信件，以及廣告連結（包含 Facebook 的分享等等）。 包含軟體的病毒，或任何電腦中可以干擾傷害或者限制跟干擾任何使用軟體硬體或者通訊器材，或者竊取系統密碼資料或者任何聯結的檔案程式碼或軟體。模仿任何公司企業或個人（包含企業員工以及第三方）的資訊。',
      '另外，用戶（包含訪客以及會員）不得為任何非法目利用渦潮服務從事以下活動：',
      '未經允許，進入渦潮網站系統（包含後台主機以及任何提供渦潮服務的設備，以下簡稱“渦潮網站系統”）或者使用渦潮電腦系統； 未經允許，對渦潮網站系統進行刪除、修改或者增加； 未經允許，對進入渦潮網站系統中儲存、處理或者傳輸的數據和應用程式進行刪除、修改或者增加； 故意製作或傳播電腦病毒等破壞性程序及其他危害渦潮網站系統安全的行為。',
      '如用戶在使用網站服務時違反任何上述規定，渦潮或其授權的人有權要求用戶改正或直接採取一切必要的措施（包括但不限於更改或刪除用戶張貼的內容等、暫停或終止用戶使用網絡服務的權利）以減輕和消除用戶不當行為造成的影響。用戶不得對本服務任何部分或本服務之使用或獲得，進行複制、拷貝、出售、轉售或用於任何其它商業目的。',
      '用戶須對自己在使用渦潮服務過程中的行為承擔法律責任。用戶承擔法律責任的形式包括但不限於：對受到侵害者進行賠償，以及在渦潮網站首先承擔了因用戶行為導致的行政處罰或侵權損害賠償責任後，給予渦潮網站等額的賠償。'
    ]
  },
  {
    title: '七、贊助以及商業行為規定',
    content: [
      '渦潮是一個集合群眾並贊助創意的平台。渦潮允許部份的使用者（提案人）將創意提出並尋求第三方（贊助者）的贊助。渦潮使用的金流服務協力廠商為藍新科技股份有限公司建置之「藍新金流 NewebPay」。透過本網站存取協力廠商服務時，會請您同意接受協力廠商新的條款及條件。渦潮不會對您與該協力廠商之間的糾紛負責。',
      '渦潮將不會對任何在服務中所接觸的個人以及團體做任何的擔保。這包括但不限於下列行為：貨品的運送以及其他的服務，任何跟渦潮無關的相關條約規定以及保固和保證等等。渦潮將不會負責監控專案的進度以及表現，也不會負責專案失敗所造成的金錢損失以及任何可能的權利喪失。當您使用渦潮服務時，即表示您了解專案的回饋不一定能被實現，您願意承擔使用過程中所產生的所有風險、對任何損害或損失負全部責任，並了解且同意渦潮並不保證回饋的實現與退款。所有的贊助以及交易皆為提案人以及贊助者間之行為，贊助者有權決定是否贊助專案，提案人亦有權決定是否接受贊助者的贊助，渦潮不會也並無義務對任何提案人以及資助者間的糾紛，以及任何網站會員和第三方的糾紛，做任何形式的負責。在糾紛中，渦潮與任何渦潮的主管員工，以及相關人員皆與任何形式的求償以及傷害賠償等無關。',
      '由於渦潮無法完全控制提案人的行為，因此提案人將對其提供的專案以及全部內容做完全的負責。渦潮保存隨時可取消專案提供並隨時退還所有資助者金額的權利。',
      '渦潮對於藍新金流 NewebPay 平台服務的效能以及服務品質，不負任何責任以及保證。有時藍新金流 NewebPay 平台會出現信用卡的付款問題，渦潮無法保證您的付款網能夠完整到達。提案人可自行決定退還款項，渦潮不負責提案人的退款，包含任何手續和過程。',
      '渦潮擁有任何時間可取消、修改以及干涉專案的權利。渦潮擁有在任何時間無條件取消或退費會員及第三方贊助的權利。'
    ]
  },
  {
    title: '八、收費與手續費',
    content: [
      '加入渦潮是免費的，但相關服務須收取費用。當你使用服務時，你會知道收取的手續費比例，並且可決定是否接受。渦潮保留此手續費比例改變的權利。當手續費改變時，我們會在網站上公告。渦潮同時保留因為特殊活動或者宣傳而改變手續費比例的權利，如有手續費改變的行為，同樣會在公告以及專案頁面上看到。',
      '用戶有付費使用（包含相關手續費用）渦潮相關服務的義務。如有專案違反規定並被取消，已被收取的手續費並不會退費，除非渦潮認定此專案有退費的需要。'
    ]
  },
  {
    title: '九、第三方連結',
    content: [
      '本服務或第三方可提供網路上其他網站或資源之連結。由於渦潮無法控制這些網站及資源，因此用戶需瞭解且同意，此類網站或資源是否可供利用，渦潮並不負相關責任;存取或外連此類網站或資源之任何內容、廣告、產品或其它資料，渦潮亦不負保證或任何負責。如果因為使用或依賴任何此類網站或資源，或經由此類網站或資源獲得的任何內容、商品或服務所產生的任何損害或損失，渦潮不負任何直接或間接之責任。'
    ]
  },
  {
    title: '十、內容和其他合法權益（包括但不限於名譽權、商譽權）',
    content: [
      '渦潮將不會對您發佈到渦潮服務中的文本、文件、圖像、照片（包括您自己的照片）、視頻、聲音、音樂作品、創作作品或任何其他材料（合稱為 " 內容 " ）擁有任何智慧財產權。在您將內容發佈到渦潮服務中，您將繼續保有對此類內容的相關權利，並且有權利依據您選擇的方式使用此內容。',
      '渦潮服務中包含渦潮提供的內容，包含會員和其他渦潮許可方的內容（下稱 " 渦潮的內容 " ）。渦潮的內容受《中華民國著作權法》、《中華民國商標法》、《中華民國專利法》和其他相關法律法規的保護，渦潮擁有並保持對渦潮的內容和渦潮服務的所有權利。'
    ]
  },
  {
    title: '十一、終止服務',
    content: [
      '用戶需同意渦潮可行基於其自行之考慮以及任何理由，包含但不限於缺乏使用，或渦潮認為用戶已經違反本服務條款，並可終止密碼、帳號或本服務之使用（或服務之任何部分），並將在本服務內任何內容加以移除並刪除。',
      '渦潮亦可以基於自身考慮，在通知或未通知之情形下，隨時終止本服務或其任何部分。用戶需同意依本服務條款任何規定提供之本服務，無需進行事先通知即可中斷或終止。用戶承認並同意，渦潮可立即關閉或刪除您的帳號及您帳號中所有相關信息及文件，及/或禁止繼續使用前述文件或本服務。此外，用戶同意若本服務之使用被中斷或終止用戶帳號及相關信息和文件被關閉或刪除，渦潮對用戶或任何第三人均不承擔任何責任。'
    ]
  },
  {
    title: '十二、賠償',
    content: [
      '用戶通過本服務提供、張貼或傳送之內容、與本服務連線、如違反本服務公約、或侵害他人任何權利因而衍生或導致任何第三人提出任何索賠或請求，包括合理的律師費，用戶需同意賠償渦潮及其子公司、相關企業、高級職員、代理人、品牌共有人或其它合作夥伴及員工，並使其免受損害。'
    ]
  },
  {
    title: '十三、關於使用及儲存之一般措施',
    content: [
      '關於本服務的使用，渦潮有權制訂一般措施及限制（包含但不限於）：本服務將保留電子郵件訊息、所張貼內容或其它上載內容之最長期限、本服務一個帳號當中可收發訊息的最大數量、本服務一個帳號當中可收發的單個訊息的大小、渦潮服務器為您分配的最大磁盤空間，以及一定期間內您使用本服務之次數上限（及每次使用時間之上限）。通過本服務存儲或傳送之任何信息、通訊資料和其它內容，如被刪除或未予儲存。用戶同意渦潮毋須承擔任何責任。用戶亦同意，超過一年未使用的帳號，渦潮有權關閉。用戶也同意，渦潮有權依其自行之考慮，不論通知與否，隨時變更這些一般措施及限制。'
    ]
  },
  {
    title: '十四、服務之修改',
    content: [
      '渦潮有權於任何時間暫時或永久修改或終止本服務（或其任何部分），而無論其通知與否。您同意您張貼到渦潮的內容，煩請您隨時為資料備份，以防資料遺失，渦潮不對任何內容丟失以及您因此而遭受的相關損失承擔責任。您同意對於本服務所作的任何修改、暫停或終止，渦潮對您和任何第三人均無需承擔任何責任。'
    ]
  },
  {
    title: '十五、與廣告商進行之交易',
    content: [
      '用戶通過本服務與廣告商進行任何形式的通訊或商業往來，或參與促銷活動，包含相關商品或服務之付款及交付，以及達成的其它任何相關條款、條件、保證或聲明，完全為用戶與廣告商之間之行為。除有關法律法規有明文規定要求渦潮承擔責任以外，用戶因前述任何交易或前述廣告商而遭受的任何性質的損失或損害，渦潮均不予負責。'
    ]
  },
  {
    title: '十六、禁止商業行為',
    content: [
      '用戶同意不對本服務任何部分或本服務之使用或獲得，進行複制、拷貝、出售、轉售或用於任何其它商業目的。'
    ]
  },
  {
    title: '十七、渦潮之專屬權利',
    content: [
      '用戶需了解並同意，本服務及本服務所使用之相關軟體（以下簡稱 " 軟體 " ）含有受到相關智慧財產權及其它法律保護之特別保密資料。另外用戶也需了解並同意，經由本服務或廣告商呈現之贊助廣告或資訊所包含之內容，亦受到著作權、商標權、專利權或其它專屬權利之法律保護。未經渦潮或廣告商明示授權，您不得修改、出租、出借、出售、散佈本服務或軟件之任何部份或全部，或據以製作衍生著作，或使用擅自修改後的軟體，包括但不限於為了未經授權而使用本服務之目的。渦潮僅授予用戶個人、不可移轉及非專屬之使用權，得於單機電腦使用其軟體，但用戶不得（並不得允許任何第三人）複製、修改、創作衍生著作、進行還原工程、反向解碼，或以其它方式發現原始碼，或出售、轉讓、再授權或提供軟體設定擔保，或以其它方式移轉。用戶同意將通過由渦潮所提供的界面而非任何其它途徑使用本服務。'
    ]
  },
  {
    title: '十八、擔保與保證您明確了解並同意書',
    content: [
      '本服務條款的任何規定不會免除渦潮對造成用戶人身傷害的、或因故意或重大過失造成您財產損失的任何責任。',
      '用戶使用本服務之風險由個人負擔。本服務係依 " 現狀 " 及 " 現有 " 基礎提供。渦潮對本服務不提供任何明示或默示的擔保或保證，包含但不限於商業性、特定目的之適用性及未侵害他人權利等擔保或保證。',
      '渦潮不保證以下事項：'
    ],
    list: [
      '本服務將符合您的要求，',
      '本服務將不受干擾、及時提供、安全可靠或不會出錯，',
      '使用本服務取得之結果正確可靠，',
      '您經由本服務購買或取得之任何產品、服務、資訊或其它信息將符合您的期望，且軟體中任何錯誤都將得到更正。',
      '是否使用本服務下載或取得任何資料應由用戶自行考慮且自負風險，因任何資料之下載而導致的電腦系統之任何損壞或數據流失等後果，由用戶自行承擔。',
      '用戶自渦潮或經由本服務取得的任何建議或資訊，無論是書面或口頭形式，除非本服務條款有明確規定，將不構成本服務條款以外之任何保證。'
    ]
  },
  {
    title: '十九、責任限制',
    content: [
      '您明確了解並同意，基於以下原因而造成的，包括但不限於利潤、信譽、應用、數據損失或其它無形損失，渦潮不承擔任何直接、間接、附帶、特別、衍生性或懲罰性賠償責任（即使渦潮事先已被告知發生此種賠償之可能性亦然）：'
    ],
    list: [
      '本服務之使用或無法使用',
      '為替換或通過本服務購買或取得之任何商品、數據、資訊、服務、收到的訊息、或完成之交易而發生的成本',
      '您的傳輸或數據遭到未獲授權的存取或變造',
      '任何第三方在本服務中所作之聲明或行為'
    ],
    secondContent: [
      '與本服務相關的其它事宜，但本服務條款有明確規定的除外。'
    ]
  },
  {
    title: '廿、一般性條款',
    content: [
      '本服務條款構成用戶與渦潮之全部協議，並規範您對於本服務之使用行為，並取代您先前與渦潮所達成的全部協議。在您使用相關服務、使用第三方提供的內容或軟件時，亦應遵從所適用之附加條款及條件。',
      '本服務條款及您與渦潮之關係，均受到中華民國法律管轄。',
      '您與渦潮就本服務、本服務公約或其它有關事項發生的爭議，應以台北地方法院為最後裁決，對雙方均有約束力。',
      '渦潮未行使或執行本服務條款任何權利或規定，不構成對前述權利或權利之放棄。',
      '倘本服務條款之任何規定因與中華民國法律抵觸而無效，用戶需依同意應依照法律，並努力使該規定所反映之當事人意向具備效力，且本服務條款其它規定仍應具有完整的效力及效果。',
      '本服務條款之標題僅供方便而設，不具任何法律或契約效果。'
    ]
  },
  {
    title: '廿一、舉報',
    content: [
      '倘發現任何違反本服務條款之情事，請通知渦潮。'
    ]
  }
]

</script>

<template>
  <div class="lt-md:(px-5 gap-5) flex flex-col md:gap-10">
    <h1 class="text-h2 leading-h2 text-brand-1 font-bold">渦潮使用條款</h1>
    <div v-for="({ title, content, list, secondContent } ,index) in data" :key="index" class="flex flex-col gap-3 md:gap-5">
      <h2 v-if="title" class="text-gray-1 text-h5 leading-h5 font-medium">{{ title }}</h2>
      <div v-if="content" class="flex flex-col gap-3">
        <p v-for="(c ,index) in content" :key="index" class="text-gray-2 leading-h4">{{ c }}</p>
      </div>

      <ul v-if="list" class="flex flex-col gap-3">
        <li v-for="(item, index) in list" :key="index" class="text-gray-2 leading-h4">{{ item }}</li>
      </ul>

      <div v-if="secondContent" class="flex flex-col gap-3">
        <p v-for="(c ,index) in secondContent" :key="index" class="text-gray-2 leading-h4">{{ c }}</p>
      </div>
    </div>
  </div>
</template>
