<script setup lang="ts">
const data = [
  {
    title: '發起計畫',
    list: [
      {
        q: '集資的時間有限制嗎？',
        a: '建議計畫在 35-45 天左右。計畫時間太長對於達標少有幫助，贊助人也會因此看不到您需要資金的急迫性。集資期限並不包括計畫執行時間。計畫執行時間並沒有限制。'
      },
      {
        q: '集資目標有限制嗎？',
        a: '金額沒有限制。但渦潮上的計畫只要沒有達到目標，收到的贊助金額會全數退回給支持者。'
      },
      {
        q: '發起計畫需要付錢嗎？',
        a: '渦潮收取計畫成功後金額的 8%，其中包含金流服務和渦潮收取的手續費以及渦潮網站的維護費用。我們收取小額的網站維護費用是為確保渦潮能夠長久經營，幫助更多的創作人。'
      },
      {
        q: '我發起的計畫集資成功了，什麼時候才能拿到贊助的款項呢？',
        a: '計畫成功結束後，渦潮將扣除交付款項所需之手續費後，於次月十三日前將剩餘之代收款項給付給提案人。'
      },
      {
        q: '我發起的計畫集資成功了，我該怎麼聯絡贊助人？',
        a: '計畫成功結束後，提案人的可以在計畫頁面工具箱中找到「贊助人列表」，其中包含所有贊助人的聯絡資料和贊助細節。'
      },
      {
        q: '渦潮上的計畫屬於公益勸募的範圍嗎？',
        a: '提案人如欲進行公益集資計畫，建議先向主管機關或專業人士咨詢相關規範，並採取相應措施。另外，渦潮建議群眾集資計畫應提供回饋給贊助人。若您的計畫無法提供回饋，就失去了群眾集資「你支持、我回饋」的互益精神。'
      },
      {
        q: '在渦潮上面發起計畫有哪些好處？',
        a: '渦潮專注於鼓勵、幫助台灣的創意人做自己想做的事情。在渦潮上提案除了會在渦潮網站、渦潮 facebook 頁面曝光以外，還有機會登上與我們合作的其他社群媒體平台。渦潮一直以來專注於設計、藝術、創意類的計畫，已經聚集了一個相當熱情的藝術設計愛好者社群。渦潮團隊成員各個來自產品設計、網頁設計、都市設計、時裝設計、音樂等等的背景，將會盡力提供專業意見幫助提案人實現夢想。'
      },
      {
        q: '在網站上提案以後會發生什麼事情？',
        a: '你將會收到一封渦潮的確認收到計畫的信件，這時候你的計畫會在待審核的狀態。同時間你可以慢慢將全部內容完成，增加回饋選項等等。渦潮專案部同仁完成審核步驟後，如有通過審核，我們會寄送通知信至您註冊會員時所使用的信箱。一切準備成功後，必須聯絡專案團隊，確認計畫內容完成，計畫才會公開在網站上。'
      },
      {
        q: '我想要提案，但是我的內容還沒有準備好，可以先和你們討論嗎？',
        a: '在渦潮上提案後至正式上線前，你都可以繼續修改計畫內容，所以不用擔心資料還沒準備完善就提案，之後有的是時間修改！但請注意還是必須提供足夠的計畫內容以供渦潮專案部評估。'
      },
      {
        q: '為什麼計畫要經過審核？',
        a: '渦潮一直以來都有獨特的計畫類別和族群，這是因為我們竭力想要培養的一個愛好藝術設計文化的社群，因此我們會就提案的內容做評估。然而渦潮就提案人所刊載內容之真實性、合法性、即時性等並無審查之義務，亦不負任何明示或默示之承諾或擔保。'
      }
    ]
  },
  {
    title: '贊助計畫',
    list: [
      {
        q: '我人不在台灣/不是台灣人可以支持計畫嗎？',
        a: '可以，但是不是所有計畫都會運送到台灣以外的地區。建議您在贊助計畫前使用計畫頁面上的聯絡提案人功能來和提案者確認。'
      },
      {
        q: '贊助計畫以後什麼時候才會收到回饋？',
        a: '每一個計畫回饋的選項不一樣，在回饋選項說明下方都會標示預計送出日期，但因為選項的預計送出日期都是估計，所以不一定會準確。請密切注意提案人的更新、動態來確定時間。如果有疑惑請使用計畫頁面上的聯絡提案人功能來和提案者確認。'
      },
      {
        q: '我支持的計畫沒有成功/失敗了的話，我贊助的錢跑去哪裡？',
        a: '如果計畫期限到了仍然沒有達到目標，渦潮會透過您贊助時的原付款方式退還你所支持的金額（不包含虛擬帳號轉帳交易手續費）。您將會收到金流公司所寄出的退款信件，請根據信中的指示完成退款步驟。'
      },
      {
        q: '我想取消贊助或退款，該怎麼做？',
        a: '如果您所支持的計畫仍在計畫集資期間尚未結束，您可以與渦潮客服聯絡，我們會透過您贊助時的原付款方式退還你所支持的金額（不包含虛擬帳號轉帳交易手續費）。如果該計畫已經集資結束，您則需要與提案人聯絡。'
      },
      {
        q: '我想要贊助計畫，可以透過哪些方式呢？',
        a: '渦潮目前有提供國內外信用卡刷卡以及實體 ATM 付款。礙於若計畫失敗可能需要退款的狀況，渦潮暫時不提供超商繳費的功能。'
      },
      {
        q: '我還沒有收到贊助回饋，怎麼辦？',
        a: '在計畫成功以後，計畫進行的資訊將會由提案人提供，渦潮部分將不會干涉。如果有疑問可以到計畫頁面查看提案人是否有在提案頁面做出計畫更新，或使用計畫頁面上的聯絡提案人功能來和提案者確認。也建議直接到提案計畫粉絲專頁、網站等等，向提案者詢問。如果仍然沒得到回應，歡迎聯絡渦潮並留下聯絡方式，我們將會要求提案人主動聯絡您。'
      },
      {
        q: '贊助計畫會有收據嗎？',
        a: '贊助渦潮的計畫後，您會收到由渦潮合作的金流公司 Paynow 所寄出的 Email 收款證明，此證明並非電子發票。贊助回饋的發票或收據，在計畫成功達標結束後，將由計畫提案人負責處理。'
      },
      {
        q: '我使用實體 ATM 轉帳了，為什麼遲遲沒有收到贊助成功確認信件？',
        a: '若在 24 小時後仍未收到確認信件，也確認金額有離開您的銀行帳戶，請聯絡渦潮，並提供您的訂單編號。'
      },
      {
        q: '如何訂閱？',
        a: '訂閱式贊助提供提案團隊長期的贊助，多數的訂閱是透過約定授扣完成。約定授扣在贊助人同意後，會於每月月初進行扣款。部份專案也提供一次給付多期金額的付款方式。'
      },
      {
        q: '如何停止訂閱、取消授扣？',
        a: '贊助人可透過「贊助記錄」，在「修改 / 查看記錄」頁面中，透過「停止訂閱」功能按鍵停止訂閱授扣。若為一次給付多期的訂閱，依該筆款項狀況可能由提案團隊或渦潮客服執行退款，詳細情況請提供贊助編號來信渦潮客服詢問。'
      }
    ]
  },
  {
    title: '其他',
    list: [
      {
        q: '我想要採訪渦潮，怎麼聯絡你們？',
        a: '請寄信到渦潮媒體聯絡信箱。'
      },
      {
        q: '你們有在接受合作提案嗎？要跟誰聯絡？',
        a: '渦潮一直都很希望能參與鼓勵創意人的合作，舉凡講座、座談會、創意市集、表演、聚會活動渦潮都很有興趣參與。請寄信到渦潮團隊聯絡信箱。如果您是想和渦潮上面的計畫提案人合作，請使用計畫頁面上的聯絡提案人功能來連絡提案人。'
      },
      {
        q: '請問可以刪除個人帳號嗎？',
        a: '請來信並附上您的帳號信箱。'
      }
    ]
  }
]
</script>

<template>
  <div class="lt-md:(px-5 gap-5) flex flex-col md:gap-10">
    <h1 class="text-h2 leading-h2 text-brand-1 font-bold">常見問題</h1>
    <div v-for="({ title, list },i) in data" :key="i" class="flex flex-col gap-10">
      <h2 class="text-gray-1 text-h3 leading-h3 font-medium">{{ title }}</h2>
      <div class="grid lg:grid-cols-3 gap-10">
        <div v-for="{ q, a },i in list" :key="i"  class="flex flex-col gap-5 bg-brand-4 rounded-2xl p-5 shadow-lg shadow-gray-4 hover:(transition scale-110)">
          <h3 class="text-gray-1 text-h5 leading-h5">{{ q }}</h3>
          <p class="text-gray-2">{{ a }}</p>
        </div>
      </div>
    </div>
    <div class="w-full bg-line h-1px my-10 lg:my-15"></div>
    <p class="text-gray-2 text-center">還是沒有你要的答案？<a class="text-brand-1 hover:text-brand-2 cursor-pointer" href="mailto:wowcho2023@gmail.com">聯絡我們</a>。</p>
  </div>
</template>
