<script setup lang="ts">
const data = [
  {
    content: [
      'wowcho.com 為渦潮所經營管理之網路平台（以下稱「本網站」），我們對於每位使用者的隱私權相當重視，將依本政策及個人資料保護法規定，蒐集、利用、處理與保護您的個人資料，也希望您在使用本平台之服務前，能夠詳細閱讀下列說明，並確實遵守，謝謝。'
    ]
  },
  {
    title: '本政策所涵蓋之範圍',
    list: [
      '本政策所涵蓋之範圍包括所有渦潮透過本網站（wowcho.com）所向您蒐集個人資訊及其後續之利用、處理行為，包含：使用者名稱、年齡、性別、職業、通訊地址、 Email 與連絡電話，或其他您註冊時或其後所同意渦潮蒐集之個人資訊。',
      '本政策之效力範圍僅及於本網站，若您點選第三人網站之連結或廣告，拜訪各該網站或網頁時，應依各該網站或網頁之經營者所定之隱私權政策規定處理，與渦潮無涉。',
      '於使用渦潮所提供之服務前，請確認您能確實遵守本政策所列全部條款，若您不同意全部或部分者，則請勿使用本網站服務。'
    ]
  },
  {
    title: '資訊蒐集與使用',
    content: [
      '本網站提供 Facebook 登入和渦潮網站內註冊兩種登入方式，分別會蒐集使用者之下列資訊：',
      'Facebook 登入：經 Facebook 帳號認證之 Email 帳號，以及使用者在 Facebook 上的性別。',
      '渦潮網站內註冊：使用者任一組常用且真實存在的 Email 和登入本網站所需之個人密碼。'
    ],
    list: [
      '渦潮會於您進行網站註冊、使用各項產品或服務、瀏覽網頁、回報使用意見，或是參加促銷廣告方案時，依據您所進行之行動蒐集必要之個人資訊，或是留下您的使用記錄以備日後查詢。所蒐集之資料將被我們用來改進所提供的服務，並避免對於我們服務的濫用與詐騙行為。個人資料處理之期限至您通知渦潮終止與本網站之會員關係為止。',
      '渦潮於您使用本網站時，系統會自動記錄您所在之 IP 位置，並記錄您所瀏覽之網頁，與所使用之服務內容，並據此防範對我們網站或服務的濫用行為。',
      '渦潮於蒐集使用者資訊後，主要目的係用於客製化您所可能有興趣之廣告、提供滿足您所需要之產品或服務、改進我們提供之產品或服務、就使用者資料進行系統內部比對以利使用者彼此互通或提供新服務、聯絡使用者、進行市場調查、或提供匿名報告給數位資訊於內部或外部之客戶。',
      '我們不會向您顯示任何針對敏感類別 (例如種族、宗教、性傾向或健康狀況等類別) 打造的個人化廣告。',
      '專案提案人因為要接受贊助者贊助款項及確實查核提案人身份，渦潮會要求提案人提供真實姓名、連絡電話、通訊地址、以及提案人收取贊助款項的金融機構帳戶，渦潮得依核實提案人身分的需求，要求提案者提供確認身分之其他資料。如提案人為法人集團，渦潮得有權收集該法人之統一編號、負責人姓名、聯絡地址等各式公開資訊。渦潮不會逕行公開上述資訊，但若應贊助者要求，渦潮會提供提案人聯絡資訊給贊助者，以確保贊助者之權益，同時便利專案之進行。',
      '渦潮為協助專案提案人收受贊助與履行回饋，會對贊助者蒐集下列資訊：贊助者該次贊助之金額、所選回饋項目、贊助者所指定之回饋收件人姓名、收件人電話及聯絡地址。',
      '若您有使用 Facebook 或其他社群服務，渦潮可能透過相關社群服務系統設計，於取得您的同意後，將部分本網站的資訊發布於您的社群活動資訊頁面，若您不同意該等訊息之發布，請您勿點選同意鍵，或於事後透過各該社群服務之會員機制移除該等資訊或拒絕本網站繼續發布相關訊息。若有任何問題，仍可與渦潮聯絡，渦潮將協助您確認、處理相關問題。'
    ]
  },
  {
    title: '資訊分享與揭露',
    content: [
    '除非事前經過您的同意，渦潮並不會將您的個人資訊任意提供或洩漏予第三人，但下列狀況則不在本條限制內：'
    ],
    list: [
      '在法院、檢察署、警察機關或法令之正式要求下，渦潮得以將必要之個人資訊內容提供給上列之政府機關。',
      '在必要的狀況下，渦潮得以分享使用者資訊給第三者以偵查或防範可能發生之非法行為，或是避免任何違反使用者條款或隱私權政策之行為發生。',
      '當渦潮或本網站被其他第三者購併或收購資產，導致經營權轉換時，渦潮會於事前將相關細節公告於相關網站，且渦潮所擁有之全部或部分使用者資訊亦可能在經營權轉換的狀況下移轉給第三人。',
      '渦潮並不會提供個人資料任何廣告業者，然而，當您在閱讀或瀏覽渦潮個網站平台中的廣告時，因廣告業者的要求，所留下之個人資訊並不在本條款之保護範圍內。',
      '其他依法律規定所為之行為或為保護渦潮或第三人法律上之權益，為主張權益所為之行為。'
    ]
  },
  {
    title: '請求刪除您的資訊',
    list: [
      '我們收集的資料有不同的保留期限，取決於資料的內容。有些資料則會依正當業務需求或法律需求 (例如加強安全性、防範詐騙和濫用行為或保存財務記錄) 延長保留期限。',
      '如要請求刪除您的資料，請來信至 wowcho2023@gmail.com 並附上您帳戶對應的 Email / Facebook 帳戶，客服人員會與您驗證身份並確認資料刪除的細節。',
      '收到您提出的刪除資料請求後，我們會遵循刪除程序，確實將您的資料從渦潮伺服器中安全且完整地移除，或是僅保留匿名處理後的資料。',
      '為了確保贊助人的贊助回饋能夠順利地遞交到您的手中，若您有回饋尚未實現的贊助計畫，我們會保留必要的聯絡資訊直至贊助回饋成功遞交到您手中。',
      '為了致力確保渦潮服務提供妥善保護，防止您的資訊遭到誤刪或惡意刪除，刪除您個人資料的程序完成後，我們的現行和備份系統可能仍會將該資訊的副本保留一段時間才刪除。'
    ]
  },
  {
    title: '關於 Cookie',
    list: [
      '為便於日後的辨識，當您使用本網站服務時，渦潮可能會在您的電腦上設定與存取 Cookie 。',
      '渦潮會同時允許本網站之廣告商設定與存取您電腦中的 Cookie，但渦潮之隱私權政策並不包含此部分之內容。',
      '您可以透過設定您的個人電腦或上網設備，決定是否予許 Cookie 技術的使用，若您關閉 Cookie 時，可能會造成您使用本網站服務時之不便利或部分功能限制。'
    ]
  },
  {
    title: '一般規範',
    list: [
      '渦潮使用藍新科技股份有限公司建置之「藍新金流 NewebPay」作為付款工具，過程中除了藍新金流 NewebPay 平台掌握資料外，完全不會有任何付款資訊的揭露。',
      '會員有權利隨時透過登入本網站會員頁面之方式，新增、修改或更正您於本網站中所存放之個人資訊。',
      '當您同意加入本網站，並同意成為會員，即代表您同意收到任何與渦潮所提供產品或服務相關之電子郵件，其內容可能包括服務說明、帳號管理資訊、電子報等，除非使用者另行通知，否則將視為所有使用者均同意收到上述相關訊息。',
      '您依個人資料保護法享有查詢或請求閱覽、製給複製本、補充或更正、停止蒐集、處理或利用、刪除之權利。',
      '若您需要刪除渦潮所留存您的所有個人資料時，您必須終止使用本網站及渦潮所提供之服務。'
    ]
  },
  {
    title: '專案發起者規範',
    content: [
      '專案發起者必須接受善加管理其他用戶資訊的責任。此責任界定為：所有用戶資訊除了使用於專案本身，包括回饋贊助者以及運送等其他項目外，不可將資訊使用於其他活動上，更不能將資料轉賣分享等，進行任何泄漏資料之行為。'
    ]
  },
  {
    title: '保密與安全性',
    list: [
      '對於所有在工作中有必要接觸使用者資料之員工，渦潮針對每位員工僅提供有限度之使用權限，以確保使用者的資料能獲得最大的保護。',
      '渦潮服務中用戶可能會公開部份的資訊，請記得公開資訊會揭露再網站上讓大眾讀取甚致使用，因此請在分享任何資訊前都仔細思考以及檢查。',
      '渦潮強烈建議所有使用者不要任意將個人帳戶資料洩漏給第三者，渦潮亦不會透過您未提供之電話或電子信件與您聯繫，但若您決定將個人帳戶資料提供給第三者，您必須負擔資料外洩的所有責任，所有相關之隱私權規定亦以第三者之隱私權政策為依據，若您不慎洩漏帳號，亦請您立即至渦潮下之任一網站更改帳戶資料。',
      '渦潮擁有資訊安全專職人員負責監督與確保所有在其轄下網站之行為都是合法的，且所有使用者的資訊都獲得最嚴密的保護，但目前所有科技均無法確保網路上之資訊傳遞或購物交易能達 100% 安全，因此，渦潮並無法確保所有使用者在網站上傳遞訊息或購物交易的安全，因此所有使用者在使用網路產品或服務時，均需自行負擔任何網路資訊傳遞與購物交易之風險。'
    ]
  },
  {
    title: '年齡保護',
    content: [
      '未滿 20 歲之使用者，請勿自行註冊使用本網站服務，亦請勿提供相關個人資料予本網站；未成年人於註冊或使用本網站服務而同意本網站蒐集、利用其個人資訊時，應在法定代理人或監護人之同意下為之。'
    ]
  },
  {
    title: '隱私權政策之修改',
    content: [
      '當隱私權政策有任何較明顯之更動時，渦潮會在網站上公告。渦潮保留修改以及變動的權利。'
    ]
  },
  {
    title: '問題與建議',
    content: [
      '若您有任何問題，歡迎隨時來信'
    ]
  }
]

</script>

<template>
  <div class="lt-md:(px-5 gap-5) flex flex-col md:gap-10">
    <h1 class="text-h2 leading-h2 text-brand-1 font-bold">渦潮隱私權政策</h1>
    <div v-for="{ title, content, list } in data" class="flex flex-col gap-3 md:gap-5">
      <h2 v-if="title" class="text-gray-1 text-h5 leading-h5 font-medium">{{ title }}</h2>
      <div v-if="content" class="flex flex-col gap-3">
        <p v-for="c in content" class="text-gray-2 leading-h4">{{ c }}</p>
      </div>
      
      <ul v-if="list" class="flex flex-col gap-3">
        <li v-for="item in list" class="text-gray-2 leading-h4">{{ item }}</li>
      </ul>
    </div>
  </div>
</template>
